  
//************************************************************************
//  Lierda, Inc      
//************************************************************************
//                 MSP430F5438
//             -----------------
//         /|\|                 |
//          | |                 |
//          --|RST              |
//            |                 |
//            |     P5.6/UCA1TXD|------------>
//            |                 | 9600 - 8N1
//            |     P5.7/UCA1RXD|<------------

#include "msp430x54x.h"
#include ".\USCIA1_UART_Module\USCIA1_UART_Module.H"
#include "Up1CJ188_Module.H"
#include "UpChannel1_Module.H"


/******************************************************************************
  函数(模块)名称:void UpChannel1_Init(void)
  功能:	
  输入参数: 
  输出参数: 成功或失败         	 		   		 
  其它说明: 115200波特率，偶校验闰，8位数据位，1位停止位
*******************************************************************************/
void UpChannel1_Init(void)
{
    USCIA1_UARTSet(115200,0,8,1); //115200波特率，偶校验闰，8位数据位，1位停止位
}


/******************************************************************************
  函数(模块)名称:void Up1RecievProcess(void)
  功能:	上行通道处理任务
  输入参数: 无
  输出参数: 无         	 		   		 
  其它说明: 处于从机地位，被动接收由主机发送来的命令，并处理
*******************************************************************************/
void Up1RecievProcess(void)
{
    struct Up1FrameStruct FrameTemp;
    Up1CJ188_ReceivProcess(&FrameTemp);
}